# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
file_path = r"C:\jupyter\US_Baby_Names_right.csv"
baby_names = pd.read_csv(file_path)

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
b = baby_names
b = b.loc[:, 'Name':]
b

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [5]:
b.groupby('Gender').size()

Gender
F    558846
M    457549
dtype: int64

### Step 7. Group the dataset by name and assign to names

In [24]:
names = b.groupby(['Name']).sum()
names = names.sort_values('Count', ascending=False)

### Step 8. How many different names exist in the dataset?

In [21]:
names.count()

Year     17632
Count    17632
dtype: int64

### Step 9. What is the name with most occurrences?

In [26]:
names.head(1)

          Year   Count
Name
Jacob  1141099  242874

### Step 10. How many different names have the least occurrences?

In [30]:
names[names.Count==(names.Count.min())]

            Year  Count
Name
Ithzel      2004      5
Varick      2014      5
Lavi        2014      5
Toma        2011      5
Tobechukwu  2010      5
...          ...    ...
Eniola      2012      5
Atlantis    2005      5
Marci       2004      5
Simarpreet  2011      5
Nita        2007      5

[2578 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [34]:
names[names.Count == names.Count.median()]

           Year  Count
Name
Zuleima   14050     49
Vita      14075     49
Aziah     16073     49
Kaedence  18088     49
Antonina  18081     49
...         ...    ...
Mckynzie  14068     49
Yoni      16060     49
Hareem    14090     49
Jkwon     14028     49
Nazier    16061     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [36]:
names.Count.std()

11006.069467890571

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [38]:
names['Count'].describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64